const T = {
  AUTH: 'AUTH',
};

const API = {
  URL: 'http://localhost',
  PORT: 8033
};

const URL = {
  location: "https://www.google.com/search?rlz=1C1SQJL_ruUA841UA841&tbs=lf:1,lf_ui:2&tbm=lcl&sxsrf=ALeKk00WGFrxsdhFRgtBCePtaQonsCEpvA:1610299431506&q=%D1%87%D1%96%D0%BF+%D1%82%D1%8E%D0%BD%D1%96%D0%BD%D0%B3+%D0%BB%D1%8C%D0%B2%D1%96%D0%B2&rflfq=1&num=10&ved=2ahUKEwib3uLs8JHuAhWJmIsKHfcaAbYQtgN6BAgCEAc#rlfi=hd:;si:17459379120268261182;mv:[[49.85447914375345,24.057289014742626],[49.84541674275413,24.030145059511913]]"
}

const content = {
  diagnostic: [
    'При купівлі вживаного авто, щоб впевнитися у його справності варто провести повну діагностику усіх систем автомобіля. Це дозволить реально оцінити технічний стан авто і зрозуміти чи буде потреба фінансових вкладень після купівлі автомобіля.',
    'Також важливим питанням при догляді за автомобілем є діагностика. Від кваліфікованого виконання діагностичних заходів залежить якість виявлення критичних несправностей деталей авто та їх ефективне усунення.',
    'У нашому сервісному центрі ви зможете провести комплексну діагностику автомобіля завдяки наявності сучасного європейського діагностичного обладнання, застосування якого дозволяє точно встановити стан деталей автомобіля, отримати достовірну інформацію про наявність прихованих пошкоджень або зносу.',
    'Можлива діагностика окремих систем автомобіля або повне обстеження. При комплексній діагностиці проводяться наступні види робіт:',
    '- комп\'ютерна діагностика всіх систем авто',
    '- обстеження системи запалювання (бензинова або дизельна)',
    '- будь-які види діагностики коробки передач (АКПП або механічна)',
    '- тестування роботи гальмівної системи',
    '- комплексна перевірка стану підвіски',
    '- перевірка роботи оптики і систем освітлення',
    'Після повної діагностики автомобіля наші майстри підготують список рекомендацій для власника щодо усунення виявлених несправностей або технічного обслуговування.',
    'Працюємо з автомобілів усіх марок, як бюджетних так і преміум класу.  Діагностика автомобіля не займає багато часу, зате ви точно будете знати, що з вашим авто все в порядку, а доступні ціни вас тільки порадують.'
  ]
}

export {
  T,
  API,
  URL,
  content,
};
