const T = {
  AUTH: 'AUTH',
};

const API = {
  URL: 'http://localhost',
  PORT: 8033
};

const URL = {
  location: "https://www.google.com/search?rlz=1C1SQJL_ruUA841UA841&tbs=lf:1,lf_ui:2&tbm=lcl&sxsrf=ALeKk00WGFrxsdhFRgtBCePtaQonsCEpvA:1610299431506&q=%D1%87%D1%96%D0%BF+%D1%82%D1%8E%D0%BD%D1%96%D0%BD%D0%B3+%D0%BB%D1%8C%D0%B2%D1%96%D0%B2&rflfq=1&num=10&ved=2ahUKEwib3uLs8JHuAhWJmIsKHfcaAbYQtgN6BAgCEAc#rlfi=hd:;si:17459379120268261182;mv:[[49.85447914375345,24.057289014742626],[49.84541674275413,24.030145059511913]]"
}

const content = {
  diagnostic: [
    'При купівлі вживаного авто, щоб впевнитися у його справності варто провести повну діагностику усіх систем автомобіля. Це дозволить реально оцінити технічний стан авто і зрозуміти чи буде потреба фінансових вкладень після купівлі автомобіля.',
    'Також важливим питанням при догляді за автомобілем є діагностика. Від кваліфікованого виконання діагностичних заходів залежить якість виявлення критичних несправностей деталей авто та їх ефективне усунення.',
    'У нашому сервісному центрі ви зможете провести комплексну діагностику автомобіля завдяки наявності сучасного європейського діагностичного обладнання, застосування якого дозволяє точно встановити стан деталей автомобіля, отримати достовірну інформацію про наявність прихованих пошкоджень або зносу.',
    'Можлива діагностика окремих систем автомобіля або повне обстеження. При комплексній діагностиці проводяться наступні види робіт:',
    '- комп\'ютерна діагностика всіх систем авто',
    '- обстеження системи запалювання (бензинова або дизельна)',
    '- будь-які види діагностики коробки передач (АКПП або механічна)',
    '- тестування роботи гальмівної системи',
    '- комплексна перевірка стану підвіски',
    '- перевірка роботи оптики і систем освітлення',
    'Після повної діагностики автомобіля наші майстри підготують список рекомендацій для власника щодо усунення виявлених несправностей або технічного обслуговування.',
    'Працюємо з автомобілів усіх марок, як бюджетних так і преміум класу.  Діагностика автомобіля не займає багато часу, зате ви точно будете знати, що з вашим авто все в порядку, а доступні ціни вас тільки порадують.'
  ],
  chipTunning: [
    'Чіп-тюнінг - це перепрограмування електронного блоку управління двигуном. В результаті ми отримуємо налагоджену роботу елементів, що входять в електронну систему блоку управління, плавність роботи двигуна, що виражається в більш рівномірною характеристиці крутного моменту, «підхоплення» з більш низьких оборотів, усунення ривків і провалів як при скиданні газу і при перемиканні передач, так і при включенні потужних споживачів, таких як кліматична установка, обігрів заднього скла і т.п.',
    'Дуже часто заводські програми управління двигуном як вітчизняних так і іноземних автомобілів дуже далекі від досконалості, а іноді зустрічається і відвертий брак. Нерідко виробник жертвує динамічними якостями автомобіля на догоду екологічним вимогам. Зустрічаються випадки, коли заявлена заводом потужність і крутний момент двигуна далекі від реальних характеристик автомобіля. Всі ці «глюки» були неодноразово описані автовласниками на тематичних форумах. Тому, якщо така поведінка автомобіля є наслідком помилки в серійної програмі, то єдиним рішенням у такому випадку є - перепрограмування блоку управління, заміна заводської прошивки на доопрацьовану, в якій ці недоліки усунуті.',
    'Тільки чіп-тюнінг є найбільш грамотним при вирішенні проблем пов\'язаних з несправностями штатних каталітичних нейтралізаторів вихлопних газів автомобілів. У разі виходу з ладу каталітичного нейтралізатора (розсипався, розплавився або просто перестав виконувати свої функції через старіння) зазвичай власник просто прибирає його, замінюючи звичайної проставкою (або пробиває ломом). В результаті отримує постійно палаючу на панелі приладів лампу несправності ( «check engine»), а двигун автомобіля починає працювати в аварійному режимі, значно збільшується витрата палива і знижується потужність. У наших силах підкоригувати цей алгоритм, програмно відключити контроль ефективності каталізатора (помилка P0420), а також стоїть після каталізатора датчик кисню (лямбда-зонд) і помилка більше з\'являтися не буде.',
    'Збільшення потужності й крутного моменту досягається шляхом оптимізації лімітерів (програмних обмежувачів крутного моменту), настройки складу суміші і запалювання. Для моторів з турбіною основним фактором також являється можливість збільшення тиску наддуву з метою збільшення циклового заряду.',
    'Результат чіп-тюнінгу: відмінний рівний розгін без провалів, хороша динаміка навіть при включенні кондиціонера, збільшення потужності й крутного моменту, і як правило - зниження витрати пального на 1-2 літри.',
    'Крім того, чіп-тюнінг вирішує ряд інших практичних завдань, таких як:',
    '- програмне відключення клапана ЕГР при його механічному заглушеній / видаленні;',
    '- усунення помилок по лямбда-зонду при видаленні каталізатора (наприклад, при його виході з ладу);',
    '- програмне відключення фільтра сажі дизельного двигуна;',
    '- зміна відсічення максимальних обертів;',
    '- відключення лімітерів швидкості, крутного моменту;',
    '- зміна алгоритму економайзера (включення ПХХ);',
    '- коригування оборотів холостого ходу;',
    '- коригування режиму включення кондиціонера;',
    '- коригування алгоритмів роботи CVT, АКПП'
  ],
  deleteFilter: [
    'Сама назва цього елемента вже говорить про його призначення - затримувати частинки забруднюючих речовин, наприклад, сажі, оксиду азоту, оксиду вуглецю та інших продуктів роботи дизельного палива.',
    'Конструкція сажевого фільтра (DPF - diesel particulatefilter, FAP) являє собою тисячі дрібних каналів, з\'єднаних між собою. Частинки сажі, які містяться у відпрацьованих вихлопах, проходять по каналах і затримуються в них. Таким чином, на виході можна спостерігати відпрацьовані гази, що не містять в собі сажу.',
    'В українських умовах цей елемент виходить з ладу в кілька разів швидше ніж в Європі, а заміна його обходиться досить дорого, в зв\'язку з чим все більшої популярності набирає послуга видалення фільтр сажі та програмне його відключення.',
    'Дана процедура не займає багато часу. Фізично видалити елемент фільтрації сажі зможе навіть непрофесіонал. Однак це все лише другорядна частина операції. Головною проблемою є бортовий комп\'ютер, який після видалення працює зі збоями, видає помилки або зовсім перестає функціонувати.',
    'Для забезпечення нормальної роботи авто ми допоможемо Вам правильного видалити сажовий фільтр та перепрограмувати бортовий комп’ютер автомобіля у найкоротші терміни.',
    'Великий досвід роботи з автомобілями самих різних марок дозволяє нам вирішувати навіть самі непрості завдання, коли необхідне втручання в складну систему електроніки автомобіля.'
  ],
  shuttingValve: [
    'Відключення клапана ЕГР (від англ. абревіатури EGR - Exhaust gasrecirculation, рециркуляція відпрацьованих газів). ',
    'Дана система була розроблена інженерами для поліпшення екологічних норм - зниження викидів в атмосферу оксидів азоту, шкідливих для здоров\'я людини.',
    'Система складається з наступних основних компонентів: патрубків, які забирають з випускного колектора частина вихлопних газів, клапана ЕГР та його приводу, патрубків, що ведуть до впускного колектора.',
    'Робота клапана ЕГР контролюється електронним блоком управління (ЕБУ) двигуна. У програмі (прошивці) ЕБУ визначено, в якому відношенні буде подаватися в циліндри палива, повітря і відпрацьованих газів для різних режимів роботи.',
    'Якщо система рециркуляції відпрацьованих газів вийшла з ладу, то в більшості випадків ЕБУ двигуна включає спеціальний режим роботи - аварійний режим: включається індикація «checkengine» на приладовій панелі, в пам\'ять ЕБУ записується код помилки, обмежується потужність двигуна (для турбованих - обмежуються оберти, відключається турбіна). ',
    'Відключення системи рециркуляції відпрацьованих газів полягає у відключенні управління цією системою, її контролю і настройка паливної суміші на роботу без відпрацьованих газів. Так як робота системи визначена в ЕБУ, то необхідно його перепрограмувати: скачати програму, її змінити і записати назад в ЕБУ. ',
    'Треба розуміти, що при програмному видаленні клапана ЕГР робота двигуна буде налаштована на чисте повітря і необхідно забезпечувати фізичне блокування підведення відпрацьованих газів у впускний колектор. Для цього найчастіше встановлюють на патрубок клапана спеціальну заглушку. ',
  ],
}

export {
  T,
  API,
  URL,
  content,
};
